# task_4.py
# Створіть функцію <morse_code>, яка приймає на вхід рядок у вигляді коду
#  Морзе та виводить декодоване значення (латинськими літерами).
#    Особливості:
#     -використовуються лише крапки, тире і пробіли (.-)
#     -один пробіл означає нову літеру
#     -три пробіли означають нове слово
#     -результат може бути case-insensitive (на ваш розсуд -великими чи маленькими літерами).
#     -для простоти реалізації -цифри, знаки пунктуацїї, дужки, лапки тощо використовуватися не будуть.Лише латинські літери.
#  - додайте можливість декодування сервісного сигналу SOS (...---...)
#    Приклад:
#    --. . . -.- .... ..-- -...   .. ...   .... . .-. .
#    результат: GEEKHUB IS HERE

DCT_MORSE_CHAR_CODE = {
    "A": ".-", "B": "-...", "C": "-.-.", "D": "-..", "E": ".",
    "F": "..-.", "G": "--.", "H": "....", "I": "..", "J": ".---",
    "K": "-.-", "L": ".-..", "M": "--", "N": "-.", "O": "---",
    "P": ".--.", "Q": "--.-", "R": ".-.", "S": "...", "T": "-",
    "U": "..-", "V": "...-", "W": ".--", "X": "-..-",  "Y": "-.--",
    "Z": "--..", "SOS": "...---...", "Ю": "..--",    
}

DCT_MORSE_CODE_CHAR = {value: key for key, value in DCT_MORSE_CHAR_CODE.items()}

def morse_code(msg):
    msg = msg.replace("   ", "|")
    words = msg.split("|")
    result_msg = []
    for word in words:
        letters = word.split(" ")
        result_word = []
        for char in letters:
            result_word.append(DCT_MORSE_CODE_CHAR.get(char, "_"))
        result_msg.append("".join(result_word))

    return " ".join(result_msg)

if __name__ == "__main__":
    msgs = (
        "--. . . -.- .... ..-- -...   .. ...   .... . .-. .",
        "--. . . -.- .... ..- -...   .. ...   .... . .-. .",
        "...---...   .-- .   .- .-. .   .-.. .. ...- .   ...---..."
        )

    for msg in msgs:
        print(msg)
        print(morse_code(msg))
        print("-"*15, "\n")
